# Connect database akademik

In [110]:
def connect(nama_db = "akademik", password = "maftuh2003"):
    import psycopg2
    conn = psycopg2.connect(database = nama_db, user = "postgres", password = password, host = "localhost", port = "5432")
    return conn

#

# Membuat tabel matakuliah

In [10]:
conn = connect()
cur = conn.cursor()

cur.execute(
    '''
    CREATE TABLE IF NOT EXISTS matakuliah(
    kode_mk VARCHAR(5) NOT NULL PRIMARY KEY,
    nama_mk VARCHAR(100),
    sks SMALLINT
    );
    ''')
conn.commit()
conn.close()
print("Table berhasil dibuat")

Table berhasil dibuat

# Membuat tabel mahasiswa

In [11]:
conn = connect()
cur = conn.cursor()

cur.execute(
    '''
    CREATE TABLE IF NOT EXISTS mahasiswa(
    nim VARCHAR(5) NOT NULL PRIMARY KEY,
    nm_mhs VARCHAR(100),
    j_kel VARCHAR(1),
    kode_jur VARCHAR(2)
    );
    ''')
conn.commit()
conn.close()
print("Table berhasil dibuat")

Table berhasil dibuat

# Membuat tabel dosen

In [13]:
conn = connect()
cur = conn.cursor()

cur.execute(
    '''
    CREATE TABLE IF NOT EXISTS dosen(
    kode_dosen VARCHAR(5) NOT NULL PRIMARY KEY,
    nm_dosen VARCHAR(100)
    );
    ''')
conn.commit()
conn.close()
print("Table berhasil dibuat")

Table berhasil dibuat

# Membuat tabel jurusan

In [14]:
conn = connect()
cur = conn.cursor()

cur.execute(
    '''
    CREATE TABLE IF NOT EXISTS jurusan(
    kode_jur VARCHAR(5) NOT NULL PRIMARY KEY,
    nm_jur VARCHAR(25),
    jenjang VARCHAR(2)
    );
    ''')
conn.commit()
conn.close()
print("Table berhasil dibuat")

Table berhasil dibuat

# Membuat tabel penilaian

In [18]:
conn = connect()
cur = conn.cursor()

cur.execute(
    '''
    CREATE SEQUENCE table_name_id_seq;
    CREATE TABLE IF NOT EXISTS penilaian(
    no_ajar INT NOT NULL DEFAULT nextval('table_name_id_seq'),
    nim VARCHAR(5),
    kode_dosen VARCHAR(5),
    kode_mk VARCHAR(5),
    angka INT,
    PRIMARY KEY (no_ajar)
    );
    ''')
conn.commit()
conn.close()
print("Table berhasil dibuat")

Table berhasil dibuat

# Input data ke tabel matakuliah

In [2]:
conn = connect()
cur = conn.cursor()
cur.execute(
    '''
    INSERT INTO matakuliah (kode_mk, nama_mk, sks) 
    VALUES 
    ('M11', 'Program Aplikasi 1', 3), 
    ('M12', 'Pemrograman Visual', 3),
    ('M13', 'Sistem Database', 4),
    ('M14', 'Struktur Data', 2),
    ('M15', 'Algoritma', 2)
    ''')
conn.commit()
conn.close()
print("Input data berhasil")

IntegrityError: duplicate key value violates unique constraint "matakuliah_pkey"
DETAIL:  Key (kode_mk)=(M11) already exists.

# Input data ke tabel mahasiswa

In [3]:
conn = connect()
cur = conn.cursor()
cur.execute(
    '''
    INSERT INTO mahasiswa (nim, nm_mhs, j_kel, kode_jur) 
    VALUES 
    ('0701', 'Bambang Reno', 'L', 'SI'), 
    ('0702', 'Esti Farida', 'P', 'MI'),
    ('0703', 'Sugeng Fitriadi', 'L', 'TI'),
    ('0704', 'Budiono', 'L', 'TI'),
    ('0705', 'Setiowati', 'P', 'MI')
    ''')
conn.commit()
conn.close()
print("Input data berhasil")

IntegrityError: duplicate key value violates unique constraint "mahasiswa_pkey"
DETAIL:  Key (nim)=(0701) already exists.

# Input data ke tabel dosen

In [4]:
conn = connect()
cur = conn.cursor()
cur.execute(
    '''
    INSERT INTO dosen (kode_dosen, nm_dosen) 
    VALUES 
    ('D01', 'Budi Sugiharjo, Ir, MSc'), 
    ('D02', 'Guntara Ir, MT'),
    ('D03', 'Asep Sukmayadi, Skom'),
    ('D04', 'Alan Subchan, Skom, MM'),
    ('D05', 'Deni Silaban, Drs, MT')
    ''')
conn.commit()
conn.close()
print("Input data berhasil")

IntegrityError: duplicate key value violates unique constraint "dosen_pkey"
DETAIL:  Key (kode_dosen)=(D01) already exists.

# Input data ke tabel jurusan

In [5]:
conn = connect()
cur = conn.cursor()
cur.execute(
    '''
    INSERT INTO jurusan (kode_jur, nm_jur, jenjang) 
    VALUES 
    ('SI', 'Sistem Informasi', 'S1'), 
    ('TI', 'Teknik Informatika', 'S1'),
    ('MI', 'Manajemen Informatika', 'D3')
    ''')
conn.commit()
conn.close()
print("Input data berhasil")

IntegrityError: duplicate key value violates unique constraint "jurusan_pkey"
DETAIL:  Key (kode_jur)=(SI) already exists.

# Input data ke tabel penilaian

In [6]:
conn = connect()
cur = conn.cursor()
cur.execute(
    '''
    INSERT INTO penilaian (no_ajar, nim, kode_dosen, kode_mk, angka) 
    VALUES 
    (1, '0701', 'D01', 'M01', 50),
    (2, '0702', 'D01', 'M01', 60),
    (3, '0703', 'D01', 'M01', 70),
    (4, '0704', 'D01', 'M01', 80),
    (5, '0705', 'D01', 'M01', 90),
    (6, '0701', 'D02', 'M02', 90),
    (7, '0702', 'D02', 'M02', 80),
    (8, '0703', 'D02', 'M02', 70),
    (9, '0704', 'D02', 'M02', 60),
    (10, '0705', 'D02', 'M02', 50),
    (11, '0701', 'D03', 'M03', 80),
    (12, '0702', 'D03', 'M03', 90),
    (13, '0703', 'D03', 'M03', 50),
    (14, '0704', 'D03', 'M03', 70),
    (15, '0705', 'D03', 'M03', 60),
    (16, '0701', 'D03', 'M04', 90),
    (17, '0702', 'D03', 'M04', 80),
    (18, '0703', 'D04', 'M05', 70),
    (19, '0704', 'D04', 'M05', 60),
    (20, '0705', 'D05', 'M05', 50)
''')
conn.commit()
conn.close()
print("Input data berhasil")

IntegrityError: duplicate key value violates unique constraint "penilaian_pkey"
DETAIL:  Key (no_ajar)=(1) already exists.

# d) Nama mahasiswa yang kuliah jenjang S1

In [282]:
conn = connect()
cur = conn.cursor()
cur.execute('''
    SELECT nm_mhs
    FROM mahasiswa
    JOIN jurusan
    ON jurusan.kode_jur = mahasiswa.kode_jur
    WHERE jurusan.jenjang = 'S1';
    ''')
data = cur.fetchall()
print("Mahasiswa yang kuliah jenjang S1 adalah : ")
for user in data:
    print(' -', user[0])

Mahasiswa yang kuliah jenjang S1 adalah :
 - Bambang Reno
 - Sugeng Fitriadi
 - Budiono

# e) Nama mahasiswa yang kuliah jenjang S1 dengan jurusan Sistem Informasi

In [283]:
conn = connect()
cur = conn.cursor()
cur.execute('''
    SELECT nm_mhs
    FROM mahasiswa
    WHERE kode_jur = 'SI';
    ''')
data = cur.fetchall()
print("Mahasiswa yang kuliah jenjang S1 dengan jurusan Sistem Informasi adalah : ")
for user in data:
    print(' -', user[0])

Mahasiswa yang kuliah jenjang S1 dengan jurusan Sistem Informasi adalah :
 - Bambang Reno

# f)  Nama Mahasiswa yang memiliki nilai tertinggi dan terendah

In [280]:
def maks_min(maks = True):
    conn = connect()
    cur = conn.cursor()
    if maks:
        temp = 'MAX'
    else:
        temp ='MIN'
    cur.execute('''
        SELECT mahasiswa.nm_mhs, matakuliah.nama_mk, penilaian.angka
        FROM penilaian
        JOIN matakuliah ON matakuliah.kode_mk = penilaian.kode_mk
        JOIN mahasiswa ON mahasiswa.nim = penilaian.nim
        JOIN (SELECT '''+ temp +'''(angka) AS maks_min, kode_mk FROM penilaian GROUP BY kode_mk) x
        ON x.maks_min = penilaian.angka AND x.kode_mk = penilaian.kode_mk
        ORDER BY penilaian.kode_mk
    ''')
    data = cur.fetchall()
    return data

print("Nama Mahasiswa yang memiliki nilai tertinggi pada setiap matakuliah : ")
for user in maks_min():
    print(' -', user[1], 'adalah', user[0], 'dengan nilai', user[2])
    
print()
print("Nama Mahasiswa yang memiliki nilai terendah pada setiap matakuliah : ")
for user in maks_min(False):
    print(' -', user[1], 'adalah', user[0], 'dengan nilai', user[2])

Nama Mahasiswa yang memiliki nilai tertinggi pada setiap matakuliah :
 - Program Aplikasi 1 adalah Setiowati dengan nilai 90
 - Program Visual adalah Bambang Reno dengan nilai 90
 - Sistem Database adalah Esti Farida dengan nilai 90
 - Struktur Data adalah Bambang Reno dengan nilai 90
 - Algoritma adalah Sugeng Fitriadi dengan nilai 70

Nama Mahasiswa yang memiliki nilai terendah pada setiap matakuliah :
 - Program Aplikasi 1 adalah Bambang Reno dengan nilai 50
 - Program Visual adalah Setiowati dengan nilai 50
 - Sistem Database adalah Sugeng Fitriadi dengan nilai 50
 - Struktur Data adalah Esti Farida dengan nilai 80
 - Algoritma adalah Setiowati dengan nilai 50

#  g) Rata-rata nilai mahasiswa yang diajar oleh Dosen Guntara, Ir, MT

In [12]:
conn = connect()
cur = conn.cursor()
cur.execute('''
    SELECT AVG(angka)
    FROM penilaian
    WHERE kode_dosen = 'D02';
    ''')
data = cur.fetchall()
print("Rata-rata nilai mahasiswa yang diajar oleh Dosen Guntara, Ir, MT adalah", end =' ')
for user in data:
    print(int(user[0]))

Rata-rata nilai mahasiswa yang diajar oleh Dosen Guntara, Ir, MT adalah 70

# h) Nilai tertinggi dan terendah dari mahasiswa yang bernama Budiono

In [125]:
conn = connect()
cur = conn.cursor()
cur.execute('''
    SELECT matakuliah.nama_mk, penilaian.angka
    FROM penilaian
    JOIN matakuliah ON matakuliah.kode_mk = penilaian.kode_mk
    WHERE nim = '0704' 
    AND (angka = (SELECT MAX(angka) FROM penilaian WHERE nim = '0704')
    OR angka = (SELECT MIN(angka) FROM penilaian WHERE nim = '0704'))
    ''')
data = cur.fetchall()
print("Nilai tertinggi dan terendah dari mahasiswa yang bernama Budiono sebagai berikut :")

for user in data:
    print(' -', user[0], 'dengan nilai', user[1])

Nilai tertinggi dan terendah dari mahasiswa yang bernama Budiono sebagai berikut :
 - Program Aplikasi 1 dengan nilai 80
 - Program Visual dengan nilai 60
 - Algoritma dengan nilai 60

# i) Membuat kolom “Score” baru pada table PENILAIAN

In [196]:
conn = connect()
cur = conn.cursor()

cur.execute(
    '''
    ALTER TABLE penilaian
    ADD IF NOT EXISTS score INT;
    ''')
conn.commit()
print("Penambahan kolom berhasil")

cur.execute(
    '''
    UPDATE penilaian
    SET score = penilaian.angka * matakuliah.sks
    FROM matakuliah
    WHERE penilaian.kode_mk = matakuliah.kode_mk
    ''')

conn.commit()
conn.close()

print("Update kolom berhasil")

Penambahan kolom berhasil
Update kolom berhasil

# j) Matakuliah yang paling banyak diikuti oleh mahasiswa

In [284]:
conn = connect()
cur = conn.cursor()
cur.execute('''
    SELECT nama_mk
    FROM matakuliah
    JOIN (
        SELECT COUNT(kode_mk) AS jumlah, kode_mk
        FROM penilaian
        GROUP BY kode_mk
        ORDER BY kode_mk
        ) penilai
    ON matakuliah.kode_mk = penilai.kode_mk
    WHERE penilai.jumlah = (SELECT MAX(mycount) FROM (SELECT COUNT(kode_mk) AS mycount FROM penilaian GROUP BY kode_mk) x)
    ''')
data = cur.fetchall()
print("Matakuliah yang paling banyak diikuti oleh mahasiswa :")
for user in data:
    print(' -', user[0])

Matakuliah yang paling banyak diikuti oleh mahasiswa :
 - Program Aplikasi 1
 - Program Visual
 - Sistem Database

#  k) Dosen yang mengajar lebih dari satu matakuliah

In [161]:
conn = connect()
cur = conn.cursor()
cur.execute('''
    SELECT nm_dosen, kode_mk
    FROM dosen
    JOIN penilaian 
    ON dosen.kode_dosen = penilaian.kode_dosen
    ''')
data = cur.fetchall()
print("Nilai tertinggi dan terendah dari mahasiswa yang bernama Budiono sebagai berikut :")
for user in data:
    print(user)

Nilai tertinggi dan terendah dari mahasiswa yang bernama Budiono sebagai berikut :
('Budi Sugiharjo, Ir, MSc', 'M01')
('Budi Sugiharjo, Ir, MSc', 'M01')
('Budi Sugiharjo, Ir, MSc', 'M01')
('Budi Sugiharjo, Ir, MSc', 'M01')
('Budi Sugiharjo, Ir, MSc', 'M01')
('Guntara Ir, MT', 'M02')
('Guntara Ir, MT', 'M02')
('Guntara Ir, MT', 'M02')
('Guntara Ir, MT', 'M02')
('Guntara Ir, MT', 'M02')
('Asep Sukmayadi, Skom', 'M03')
('Asep Sukmayadi, Skom', 'M03')
('Asep Sukmayadi, Skom', 'M03')
('Asep Sukmayadi, Skom', 'M03')
('Asep Sukmayadi, Skom', 'M03')
('Asep Sukmayadi, Skom', 'M04')
('Asep Sukmayadi, Skom', 'M04')
('Alan Subchan, Skom, MM', 'M05')
('Alan Subchan, Skom, MM', 'M05')
('Deni Silaban, Drs, MT', 'M05')

# l) Membuat kolom Nilai_Kategori pada table PENILAIAN

In [250]:
conn = connect()
cur = conn.cursor()

cur.execute("ALTER TABLE penilaian ADD IF NOT EXISTS nilai_kategori VARCHAR(1);")
conn.commit()
print("Penambahan kolom berhasil")

# cur.execute('''
#     UPDATE penilaian
#     SET nilai_kategori = (SELECT angka, 
#                             CASE
#                                 WHEN angka >= 80 THEN "A"
#                                 ELSE "B"
#                             END AS kategori
#                             FROM penilaian
#                             );
#     '''
# )

cur.execute("SELECT no_ajar, angka FROM penilaian")
data = cur.fetchall()

for user in data:
    if user[1] >= 80:
        kategori = 'A'
    elif user[1] >= 70 and user[1] < 80:
        kategori = 'B'
    elif user[1] >= 60 and user[1] < 70:
        kategori = 'C'
    elif user[1] < 60:
        kategori = 'D'
    else:
        kategori = 0
    
    cur.execute("UPDATE penilaian SET nilai_kategori = '" + kategori + "' WHERE no_ajar = " + str(user[0]))
    conn.commit()
print("Update kolom berhasil")

Penambahan kolom berhasil
Update kolom berhasil

# m) Membuat kolom Nilai_akhir pada table PENILAIAN

In [236]:
conn = connect()
cur = conn.cursor()

cur.execute("ALTER TABLE penilaian ADD IF NOT EXISTS nilai_akhir VARCHAR(25);")
conn.commit()
print("Penambahan kolom berhasil")

cur.execute("SELECT no_ajar, nilai_kategori FROM penilaian")
data = cur.fetchall()

for user in data:
    if user[1] == 'A' or user[1] == 'B' or user[1] == 'C':
        nilai_akhir = "Lulus"
    else:
        nilai_akhir = "Tidak Lulus"
    
    cur.execute("UPDATE penilaian SET nilai_akhir = '" + nilai_akhir + "' WHERE no_ajar = " + str(user[0]))
    conn.commit()
print("Update kolom berhasil")

Penambahan kolom berhasil
Update kolom berhasil